ТОИР_демо/src/Documents/торо_АктПриемкиОборудования/торо_АктПриемкиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_АктПриемкиОборудования</name>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_ЗаявкаНаРемонт</basedOn>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеАкты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/InformationRegisters/торо_АктыПоРемонтам/торо_АктыПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_АктыПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <enumValues>
    <name>торо_ВыявленныеДефекты</name>
  </enumValues>
  <enumValues>
    <name>торо_АктОВыполненииЭтапаРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланГрафикРемонта</name>
  </enumValues>
  <enumValues>
    <name>торо_ЗаявкаНаРемонт</name>
  </enumValues>
  <enumValues>
    <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ВнешнееОснованиеДляРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_АктПриемкиОборудования</name>
  </enumValues>
  <enumValues>
    <name>торо_ОстановочныеРемонты</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Documents/торо_АктПриемкиОборудования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем БезусловнаяЗапись Экспорт;	// Отключает проверки при записи документа
перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
	Если НЕ ЗначениеЗаполнено(Ответственный) тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		ТекДата = ТекущаяДата();
		Дата = ?(ТекДата < ДанныеЗаполнения.Дата, ДанныеЗаполнения.Дата, ТекДата);
		
		ДокументыОснования.Добавить().ДокументОснование = ДанныеЗаполнения;
		
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СписокТЧ = Новый Структура();
	СписокТЧ.Вставить("ДокументыОснования", "Документы основания");
	СписокТЧ.Вставить("РемонтыОборудования", "Ремонты оборудования");
	торо_ОбщегоНазначения.ПроверитьЗаполненностьТабличныхЧастей(ЭтотОбъект, СписокТЧ, Отказ);
	Если Отказ тогда
		Возврат;
	КонецЕсли;	
	// Согласование++
	
	// Проверим использование статусов документов.
	
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктПриемкиОборудования;
	мИспользоватьСогласованиеДокументов = торо_Согласования.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);
	
	Если мИспользоватьСогласованиеДокументов Тогда
		торо_РаботаСоСтатусамиДокументовСервер.ПроверитьРазрешениеПроведенияПоСтатусу(Ссылка, СпособСогласования, ДополнительныеСвойства, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	// Согласование--
	
	ТЗРемонтыОборудования = РемонтыОборудования.Выгрузить();
	
	Если ТЗРемонтыОборудования.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Документ не может быть проведен без указания ремонтов оборудования! Добавьте хотя бы один ремонт!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Если Не Отказ Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	РемонтыОборудования.ОбъектРемонта,
		               |	РемонтыОборудования.ВидРемонтныхРабот,
		               |	РемонтыОборудования.ID КАК ID
		               |ПОМЕСТИТЬ РемонтыОборудования
		               |ИЗ
		               |	&РемонтыОборудования КАК РемонтыОборудования
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_АктыПоРемонтам.IDРемонта КАК ID,
		               |	торо_АктыПоРемонтам.Регистратор КАК Ссылка
		               |ПОМЕСТИТЬ АктыПоРемонтам
		               |ИЗ
		               |	РегистрСведений.торо_АктыПоРемонтам.СрезПоследних(
		               |			,
		               |			IDРемонта В
		               |				(ВЫБРАТЬ
		               |					РемонтыОборудования.ID
		               |				ИЗ
		               |					РемонтыОборудования КАК РемонтыОборудования)) КАК торо_АктыПоРемонтам
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	торо_АктыПоРемонтам.IDРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	АктыПоРемонтам.ID,
		               |	АктыПоРемонтам.Ссылка,
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ЗавершитьРемонт КАК РемонтЗавершен
		               |ПОМЕСТИТЬ торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		               |ИЗ
		               |	АктыПоРемонтам КАК АктыПоРемонтам
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		               |		ПО АктыПоРемонтам.Ссылка = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка
		               |			И АктыПоРемонтам.ID = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	АктыПоРемонтам.ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РемонтыОборудования.ОбъектРемонта,
		               |	РемонтыОборудования.ВидРемонтныхРабот,
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК Документ,
		               |	РемонтыОборудования.ID,
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.РемонтЗавершен КАК РемонтЗавершен,
		               |	ВЫБОР
		               |		КОГДА торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка ЕСТЬ NULL
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК АктыОтсутствуют
		               |ИЗ
		               |	РемонтыОборудования КАК РемонтыОборудования
		               |		ЛЕВОЕ СОЕДИНЕНИЕ торо_АктОВыполненииЭтапаРаботРемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		               |		ПО РемонтыОборудования.ID = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("РемонтыОборудования",ТЗРемонтыОборудования);
		ТабРезультат = Запрос.Выполнить().Выгрузить();
		
		ТЗЗакрываемыеАкты = ЗакрываемыеАкты.Выгрузить();
		
		ПрисутствуютВсеАкты = Истина;
		Для Каждого Строка Из ТабРезультат Цикл
			
			Ошибка = Ложь;
			Если Строка.АктыОтсутствуют Тогда
				Ошибка = Истина;
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Невозможно провести документ по причине того, что для ремонта ""%1"" для ""%2"" отсутствуют акты о выполнении этапа работ!'"),
					Строка.ВидРемонтныхРабот,Строка.ОбъектРемонта);
			ИначеЕсли ТЗЗакрываемыеАкты.НайтиСтроки(Новый Структура("ID, Документ", Строка.ID, Строка.Документ)).Количество() = 0 Тогда
				Ошибка = Истина;
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Невозможно провести документ по причине того, что для ремонта ""%1"" для ""%2"" в документе отсутствует ""%3""! Необходимо обновить таблицу закрываемых по ремонту актов!'"),
					Строка.ВидРемонтныхРабот,Строка.ОбъектРемонта,Строка.Документ);
			КонецЕсли;
			
			Если Ошибка Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЦикла;
		Если Не Отказ Тогда
			IDРемонтов = ТЗРемонтыОборудования.ВыгрузитьКолонку("ID");
			
			Для Каждого Ремонт Из IDРемонтов Цикл
				НайденныеСтроки = ТабРезультат.НайтиСтроки(Новый Структура("ID", Ремонт));
				Если НайденныеСтроки.Количество() > 0 Тогда
					Ошибка = Истина;
					Для Каждого Строка Из НайденныеСтроки Цикл
						Если ЗначениеЗаполнено(Строка.РемонтЗавершен) И Строка.РемонтЗавершен Тогда
							Ошибка = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если Ошибка Тогда
						Отказ = Истина;
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Невозможно провести документ по причине того, что для ремонта ""%1"" по объекту ""%2"" отсутствует хотя бы один акт о выполнении этапа работ с признаком завершения!'"),
							НайденныеСтроки[0].ВидРемонтныхРабот,НайденныеСтроки[0].ОбъектРемонта);
						Сообщение.Сообщить();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктПриемкиОборудования;
		торо_РаботаСоСтатусамиДокументовСервер.ПриЗаписиОбъекта(Ссылка, ВидДокумента, СпособСогласования, ДополнительныеСвойства,, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	торо_РаботаСоСтатусамиДокументовСервер.ОчиститьСогласованиеПриКопировании(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
